SYSBENCH-script/fileio.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      138.12
    writes/s:                     91.92
    fsyncs/s:                     334.32

Throughput:
    read, MiB/s:                  2.16
    written, MiB/s:               1.44

General statistics:
    total time:                          10.4308s
    total number of events:              5376

Latency (ms):
         min:                                    0.00
         avg:                                    7.46
         max:                                  122.31
         95th percentile:                       29.72
         sum:                                40113.81

Threads fairness:
    events (avg/stddev):           1344.0000/57.62
    execution time (avg/stddev):   10.0285/0.00